---
kind: property
id: P:Autodesk.Revit.UI.TextBox.Width
zh: 宽度
source: html/b8157068-f358-d7ec-69d6-09972b41273c.htm
---
# Autodesk.Revit.UI.TextBox.Width Property

**中文**: 宽度

Gets or sets the width of the TextBox.

## Syntax (C#)
```csharp
public double Width { get; set; }
```

## Remarks
The value for this property must be positive and cannot be Infinity.
This value is interpreted in device-independent units (1/96th inch) measurement
 device-independent units .
The default value is 200.